---
kind: property
id: P:Autodesk.Revit.DB.InternalOrigin.SharedPosition
source: html/856fbf8e-2c75-4c2f-c01b-1ddfcb32183b.htm
---
# Autodesk.Revit.DB.InternalOrigin.SharedPosition Property

The position of the InternalOrigin relative to the active ProjectLocation set for the document.

## Syntax (C#)
```csharp
public XYZ SharedPosition { get; }
```